// напишите программу которая на вход принимает число и показывет 
// являеться ли оно четным ( делиться ли оно на 2 ).
int a = Convert.ToInt32(Console.ReadLine());
if (a % 2 == 0)
{
    Console.WriteLine("ess");
}
else
{
    Console.WriteLine("no");
}
